In [1]:
import pandas as pd

# Intro

In [2]:
df = pd.read_csv('nyc_weather.csv')
df.head()

,EST,Temperature,DewPoint,Humidity,Sea Level PressureIn,VisibilityMiles,WindSpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,1/1/2016,38,23,52,30.03,10,8.0,0,5,NaN,281
1,1/2/2016,36,18,46,30.02,10,7.0,0,3,NaN,275
2,1/3/2016,40,21,47,29.86,10,8.0,0,1,NaN,277
3,1/4/2016,25,9,44,30.05,10,9.0,0,3,NaN,345
4,1/5/2016,20,-3,41,30.57,10,5.0,0,0,NaN,333

In [3]:
df['Temperature'].max()

50

In [4]:
df['EST'][df['Events'] == 'Rain']

8      1/9/2016
9     1/10/2016
15    1/16/2016
26    1/27/2016
Name: EST, dtype: object

In [5]:
df['WindSpeedMPH'].mean()

6.892857142857143

In [6]:
# data munging (messy data -> clean data)
df.fillna(0, inplace=True)
df['WindSpeedMPH'].mean()

6.225806451612903

# Dataframe basics

In [7]:
df = pd.read_csv('weather_data.csv')
df

# we can also create dataframe using python dictionary, where column names are key and column values are value

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [8]:
rows, cols = df.shape
# rows, cols

In [9]:
rows

6

In [10]:
cols

4

In [11]:
df.head()
# initial 5 rows

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain

In [12]:
df.tail()
# last 5 rows

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [13]:
df.describe()
# data statistics

       temperature  windspeed
count     6.000000   6.000000
mean     30.333333   4.666667
std       3.829708   2.338090
min      24.000000   2.000000
25%      28.750000   2.500000
50%      31.500000   5.000000
75%      32.000000   6.750000
max      35.000000   7.000000

In [14]:
df[2:5]
# row 2 -> row 4

        day  temperature  windspeed event
2  1/3/2017           28          2  Snow
3  1/4/2017           24          7  Snow
4  1/5/2017           32          4  Rain

In [15]:
df.columns
# get all columns

Index(['day', 'temperature', 'windspeed', 'event'], dtype='object')

In [16]:
df.day
# get values for individual columns

0    1/1/2017
1    1/2/2017
2    1/3/2017
3    1/4/2017
4    1/5/2017
5    1/6/2017
Name: day, dtype: object

In [17]:
df['event']
# get values for individual columns

0     Rain
1    Sunny
2     Snow
3     Snow
4     Rain
5    Sunny
Name: event, dtype: object

In [18]:
type(df['event'])
# columns are of types: pandas series

pandas.core.series.Series

In [19]:
df[['day', 'event']]
# printing few cols

        day  event
0  1/1/2017   Rain
1  1/2/2017  Sunny
2  1/3/2017   Snow
3  1/4/2017   Snow
4  1/5/2017   Rain
5  1/6/2017  Sunny

In [20]:
df.temperature.max()

35

In [21]:
df[df.temperature >= 32]
# conditional

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
4  1/5/2017           32          4   Rain

In [22]:
df[df.temperature == df.temperature.max()]
# row where temp was max

        day  temperature  windspeed  event
1  1/2/2017           35          7  Sunny

In [23]:
df['day'][df.temperature == df.temperature.max()]
# day where temp was max

1    1/2/2017
Name: day, dtype: object

In [24]:
df[['day', 'temperature']][df.temperature == df.temperature.max()]

        day  temperature
1  1/2/2017           35

In [25]:
df.index
# default index

RangeIndex(start=0, stop=6, step=1)

In [26]:
df = df.set_index('day')
# df.set_index('day', inplace=True)

In [27]:
df.loc['1/4/2017']

temperature      24
windspeed         7
event          Snow
Name: 1/4/2017, dtype: object

In [28]:
df.reset_index(inplace=True)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# Diff ways of creating Dataframe

In [29]:
# 1. reading the csv
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

# 2. reading excel file, using read_excel('abc.xlsx')

In [30]:
# 3. using python dict

weather_data = {
    'day': ['1/1/2017', '1/2/2017'],
    'temperature': [32, 35],
    'windspeed': [6, 7],
    'event': ['Rain', 'Sunny']
}

df = pd.DataFrame(weather_data)
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

In [31]:
# 4. using tuple's list

weather_data = [
    ('1/1/2017', 32, 6, 'Rain'),
    ('1/2/2017', 35, 7, 'Sunny')
]

df = pd.DataFrame(weather_data, columns=['day', 'temperature', 'windspeed', 'event'])
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny

# Reading and writing csv files

In [32]:
df = pd.read_csv('stock_data.csv')
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [33]:
df = pd.read_csv('stock_data.csv', skiprows=1)
df
# reading data from 1st row(skipped 0th row)

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [34]:
df = pd.read_csv('stock_data.csv', header=1)
df
# assume 1st row as header

  GOOGL          27.82   87   845     larry page
0   WMT           4.61  484    65           n.a.
1  MSFT             -1   85    64     bill gates
2  RIL   not available   50  1023  mukesh ambani
3  TATA            5.6   -1  n.a.     ratan tata

In [35]:
df = pd.read_csv('stock_data.csv', header=None, names=['tickers', 'eps', 'revenue', 'price', 'people'])
df
# in case of missing header

   tickers            eps  revenue  price         people
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

In [36]:
df = pd.read_csv('stock_data.csv', nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

In [37]:
df = pd.read_csv('stock_data.csv', na_values=['not available', 'n.a.'])
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [38]:
# converting negative revenue to Nan
df = pd.read_csv('stock_data.csv', na_values={
        'eps': ['not available', 'n.a.'],
        'revenue': ['not available', 'n.a.', -1],
        'people': ['not available', 'n.a.'],
        'price': ['not available', 'n.a.']
    })
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [39]:
# writing csv

df.to_csv('new.csv', index=False)
new_df = pd.read_csv('new.csv')
new_df

  tickers    eps  revenue   price         people
0   GOOGL  27.82     87.0   845.0     larry page
1     WMT   4.61    484.0    65.0            NaN
2    MSFT  -1.00     85.0    64.0     bill gates
3    RIL     NaN     50.0  1023.0  mukesh ambani
4    TATA   5.60      NaN     NaN     ratan tata

In [40]:
# writing selected cols, skipping header

df.to_csv('new.csv', index=False, columns=['tickers', 'eps'], header=False)
new_df = pd.read_csv('new.csv')
new_df

  GOOGL  27.82
0   WMT   4.61
1  MSFT  -1.00
2  RIL     NaN
3  TATA   5.60